/** 
  ******************************************************************************
  * @file    BSP_Init.c 
  * @author  ample
  * @version V0.0.1
  * @date    2024年3月15日(V0.0.1)：初始版本   
  * @brief   板级支持包驱动程序
  ******************************************************************************
**/ 
/* 1.Include -------------------------------------------------------------------*/
#include "BSP_Init.h"
#include "main.h"
#include "dma.h"
#include "eth.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"
/* 2.Private typedef -----------------------------------------------------------*/
/* 3.Private define ------------------------------------------------------------*/
/* 4.Private macro -------------------------------------------------------------*/
/* 5.Global variables ---------------------------------------------------------*/
/* 6.Private variables ---------------------------------------------------------*/
/* 7.Global function prototypes -----------------------------------------------*/
/* 8.Private function prototypes -----------------------------------------------*/
/*******************************************************************************
** 名    称 ： BSP_Init
** 功    能 ： 板级支持包初始化
** 入口参数 ： 无
** 出口参数 ： 无
*******************************************************************************/
void BSP_Init(void)
{
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_UART4_Init();
  MX_USART1_UART_Init();
  MX_USART2_UART_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  //MX_ETH_Init();
  MX_TIM3_Init();
  MX_TIM4_Init();
  MX_TIM5_Init();
  MX_TIM8_Init();
}

